////-------------------------------------------------------
////剑指offer面试题10- I. 斐波那契数列
////写一个函数，输入 n ，求斐波那契（Fibonacci）数列的第 n 项。斐波那契数列的定义如下：
////F(0) = 0, F(1) = 1
////F(N) = F(N - 1) + F(N - 2), 其中 N > 1.
////斐波那契数列由 0 和 1 开始，之后的斐波那契数就是由之前的两数相加而得出。
////答案需要取模 1e9 + 7（1000000007），如计算初始结果为：1000000008，请返回 1。
////---------------------------------------------------------
////解题思路：常规思路
////---------------------------------------------------------
////作者:Mxd
////时间：2020/05/26
////----------------------------------------------------------
//#include<iostream>
//#include<vector>
//using namespace std;
//class Solution {
//private:
//    vector<long> F = { 0 ,1};
//public:
//    int fib(int n) {
//        if (n < this->F.size())
//            return this->F[n];
//        for (int i = this->F.size(); i <= n; i++)
//            this->F.push_back((this->F[i - 1] + this->F[i - 2]) % 1000000007);
//        return this->F[n]% 1000000007;
//    }
//};
//int main()
//{
//    Solution S;
//    while (true)
//    {
//        int x;
//        cin >> x;
//        cout << S.fib(x) << endl;
//    }
//}
