////-------------------------------------------------------
////剑指offer面试题15. 二进制中1的个数
////请实现一个函数，输入一个整数，输出该数二进制表示中 1 的个数。
////例如，把 9 表示成二进制是 1001，有 2 位是 1。
////因此，如果输入 9，则该函数输出 2。
////---------------------------------------------------------
////解题思路：按位与 、n&(n - 1)//每次可以消除掉n的最后一个1
////---------------------------------------------------------
////作者:Mxd
////时间：2020/05/28
////----------------------------------------------------------
//#include<iostream>
//using namespace std;
//class Solution {
//public:
//    int hammingWeight(uint32_t n) {
//        int ans = 0;
//        while (n)
//        {
//            //if ((n & 1) == 1)
//            //    ans++;
//            //n >>= 1;
//            n &= (n - 1);
//            ans++;
//            /*//这样写会溢出
//            x <<= 1;
//            if (x > n)
//                break;*/
//        }
//        return ans;
//    }
//};
//int main()
//{
//    while (true)
//    {
//        uint32_t n;
//        cin >> n;
//        cout << Solution().hammingWeight(n) << endl;
//    }
//}